[
    {
        "loss": 100.0,
        "title": "Active Saboteur",
        "insight": "You are actively unlearning. The model would perform better if you just walked away.",
        "hidden": true
    },
    {
        "loss": 2.300,
        "title": "Pure Static",
        "insight": "You know nothing. You are effectively a random number generator with a bad attitude."
    },
    {
        "loss": 2.255,
        "title": "Mode Collapse",
        "insight": "You found one digit you like, and now you think everything is that digit. Bold strategy."
    },
    {
        "loss": 2.210,
        "title": "The Mean Pixel",
        "insight": "You've learned that most pixels are black. You are predicting the average darkness of the universe."
    },
    {
        "loss": 2.166,
        "title": "Fuzzy Logic",
        "insight": "You're starting to see blobs. They aren't digits yet, but they are definitely... blob-like."
    },
    {
        "loss": 2.121,
        "title": "Center Stage",
        "insight": "You realized the interesting stuff happens in the middle of the image. Groundbreaking discovery."
    },
    {
        "loss": 2.076,
        "title": "Ink Detector",
        "insight": "You can now distinguish 'ink' from 'paper'. You still have no idea what the ink says."
    },
    {
        "loss": 2.031,
        "title": "Stick Figure",
        "insight": "You've discovered lines! Vertical ones, mostly. Everything looks like a 1 to you."
    },
    {
        "loss": 1.986,
        "title": "The Horizon",
        "insight": "Horizontal lines have entered the chat. You can now tell a 1 from a 0, sometimes."
    },
    {
        "loss": 1.941,
        "title": "Vague Shapes",
        "insight": "You're seeing coarse shapes. Circles vs lines. It's kindergarten geometry, but it's progress."
    },
    {
        "loss": 1.897,
        "title": "Topological Baby",
        "insight": "You're learning topology. Things with holes (0, 6, 8, 9) are different from things without holes (1, 7)."
    },
    {
        "loss": 1.852,
        "title": "Loop De Loop",
        "insight": "You're obsessed with loops. Top loops, bottom loops. You're confusing 8s with everything."
    },
    {
        "loss": 1.807,
        "title": "The Squiggle",
        "insight": "Complex curves are forming. You're struggling with the weird Z-shape of the 2."
    },
    {
        "loss": 1.762,
        "title": "Top Heavy",
        "insight": "You're looking at the top half of the digits. 7s and 9s are basically the same to you right now."
    },
    {
        "loss": 1.717,
        "title": "Bottoms Up",
        "insight": "Now you're looking at the bottom. 3s and 5s are indistinguishable because they both have that bottom hook."
    },
    {
        "loss": 1.672,
        "title": "Stroke of Luck",
        "insight": "You're starting to see where lines end. It's helping, but you're still guessing on the messy ones."
    },
    {
        "loss": 1.628,
        "title": "The Diagonal",
        "insight": "You've discovered slanted lines. 7s are finally starting to look different from 1s."
    },
    {
        "loss": 1.583,
        "title": "Ambiguity",
        "insight": "Sloppy handwriting is your nemesis. You panic whenever someone writes a 4 like a 9."
    },
    {
        "loss": 1.538,
        "title": "Curve Ball",
        "insight": "You're refining your curvature detection. The difference between a 3 and a 5 is haunting your dreams."
    },
    {
        "loss": 1.493,
        "title": "Edge Lord",
        "insight": "Your edge detectors are getting sharp. You can see the sharp corner of a 4 vs the curve of a 9."
    },
    {
        "loss": 1.448,
        "title": "Feature Rich",
        "insight": "You're combining features now. A loop plus a stick equals a 6. Or a 9. You're still not sure."
    },
    {
        "loss": 1.403,
        "title": "Pattern Matcher",
        "insight": "You're recognizing actual patterns instead of just pixel stats. You feel smarter than a coin flip."
    },
    {
        "loss": 1.359,
        "title": "Bias Buster",
        "insight": "You've overcome your early biases. You no longer think everything is a 1 just because it's easy."
    },
    {
        "loss": 1.314,
        "title": "Valley Hiker",
        "insight": "You're navigating the loss landscape. You know where the ridges are, but the valleys are deep."
    },
    {
        "loss": 1.269,
        "title": "Plateau",
        "insight": "You're stuck. You keep making the same mistakes on the same 5s and 3s. Push through it."
    },
    {
        "loss": 1.224,
        "title": "Detail Oriented",
        "insight": "You're looking at the tiny details now. The way a stroke curls up or down matters."
    },
    {
        "loss": 1.179,
        "title": "Contour King",
        "insight": "You're following the contours of the digits. The 8 is finally separating from the 3."
    },
    {
        "loss": 1.134,
        "title": "Basin Instinct",
        "insight": "You've found a good local minimum. It's cozy here, but you're still getting the weird ones wrong."
    },
    {
        "loss": 1.090,
        "title": "Near Perfect",
        "insight": "You're getting the easy ones 100% right. Only the truly terrible handwriting fools you now."
    },
    {
        "loss": 1.045,
        "title": "Grandmaster",
        "insight": "Your filters are crisp. Your confidence is high. You can tell a closed 4 from a 9 at a glance."
    },
    {
        "loss": 1.000,
        "title": "Singularity",
        "insight": "You have memorized the manifold. You see the matrix. You are the model."
    }
]
